import { Box, Stack, Typography } from "@mui/material";
import Image from "next/image";
import React from "react";

const page = () => {
  return (
    <div>
      <Stack height="100%">
        <Typography fontWeight={700} fontSize={20} display="flex" gap="10px">
          <Image
            style={{ display: "flex", alignItems: "center" }}
            src={"/image copy 6.png"}
            width={31.27}
            height={26.77}
            priority
            alt="Food Delivery"
          />
          Хүргэлтийн бүс дэх хаягууд
        </Typography>
        <Box>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн
          интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь
          уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
          авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
          баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн
          хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч
          /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний
          нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
          хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Mstars Food
          delivery нь Mstars Lab компанийн интернэт худалдааны албан ёсны
          вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн
          интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь
          уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
          авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
          баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн
          хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч
          /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний
          нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
          хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
        </Box>
      </Stack>
    </div>
  );
};

export default page;
