import { Box, Stack, Typography } from "@mui/material";
import Image from "next/image";
import React from "react";

const page = () => {
  return (
    <div>
      <Stack height="100%">
        <div
          style={{ display: "flex", alignItems: "center", marginTop: "60px" }}
        >
          <img src="/Star.png" alt="Star" />
          <Typography
            sx={{ fontSize: "22px", fontWeight: "bold", marginLeft: "16px" }}
          >
            Нууцлалын бодлого
          </Typography>
        </div>
        <Typography
          sx={{ fontSize: "18px", fontWeight: "normal", marginTop: "30px" }}
        >
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
          <br />
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина. <br /> <br /> Mstars Food delivery нь Mstars Lab компанийн
          интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь
          уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br />
          <br />
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. <br /> <br /> Энэхүү нөхцөл нь хэрэглэгч
          худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
          баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br /> <br /> Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br /> <br /> Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний
          нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
          хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. <br /> <br />
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Typography>
      </Stack>
    </div>
  );
};

export default page;
