import { Typography } from "@mui/material";

const TermPage: React.FC = () => {
  return (
    <div>
      <div>
        <div
          style={{ display: "flex", alignItems: "center", marginTop: "60px" }}>
          <img
            src="https://res.cloudinary.com/djxo5odaa/image/upload/v1730559884/qv7dx0vczgves5hmyaz8.png"
            alt="Star"
          />
          <Typography
            sx={{ fontSize: "22px", fontWeight: "bold", marginLeft: "16px" }}>
            Үйлчилгээний нөхцөл
          </Typography>
        </div>
      </div>
      <div style={{ marginTop: "40px" }}>
        <Typography sx={{ fontSize: "18px", fontWeight: "normal" }}>
          Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны албан
          ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх,
          худалдан авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино.
          <br style={{ marginTop: "20px" }} />
          <br />
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина. <br /> <br /> Mstars Food delivery нь Mstars Lab компанийн
          интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь
          уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br />
          <br />
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
          /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
          хамтран хяналт тавина. <br /> <br /> Энэхүү нөхцөл нь хэрэглэгч
          худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
          баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br /> <br /> Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина. Mstars Food delivery нь Mstars Lab компанийн интернэт
          худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг
          вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
          харилцааг зохицуулахад оршино. <br /> <br /> Энэхүү нөхцөл нь
          хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн
          зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний
          нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон
          хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. <br /> <br />
          Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
          үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
          хэрэгжинэ. <br /> <br />
          Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид
          байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт
          тавина.
        </Typography>
      </div>
    </div>
  );
};

export default TermPage;
